/*************************************************************************
	> File Name: euler2031.cpp
	> Author:
	> Mail: 
	> Created Time: 2018年07月30日 星期一 20时01分20秒
 ************************************************************************/

#include <stdio.h>

int w[8] = {1, 2, 5, 10, 20, 50, 100, 200};
int dp[8][201] = {0};

int main(){
    for(int i = 0; i < 8; i++) {
        for(int j = 0; j < 201; j++){
            if(j == 0){
                dp[i][j] = 1;
                continue;
            }
            if(i - 1 >= 0) dp[i][j] = dp[i - 1][j];
            if(j - w[i] >= 0) dp[i][j] += dp[i][j - w[i]];
        }
    }


    printf("%d\n",dp[7][200]);
    return 0;
}
